

print('--------------------------------------------------------------------')
print('0 에서 99 까지 더하기 예제')
print('--------------------------------------------------------------------')

local sum = 0 
for i = 0, 99 do
    sum = sum + i
    -- print(sum, i)
end

print(sum)
--> 4950


print('--------------------------------------------------------------------')
print('99에서 0까지 더하기 예제')
print('--------------------------------------------------------------------')
sum = 0 
for i = 99, 0, -1 do
    sum = sum + i
    -- print(sum, i)
end

print(sum)
--> 4950


print('--------------------------------------------------------------------')
print('일반 배열 테이블에 대한 for')
print('--------------------------------------------------------------------')
local list = {'영어', '수학', '과학'}

for i = 1, #list do 
    print(list[i])
end
--> 영어
--> 수학
--> 과학

print('--------------------------------------------------------------------')
print('(키/값)으로 이뤄진 테이블에 대한 for')
print('--------------------------------------------------------------------')
local list2 = {eng = 100, math = 90, sci = 80}

for i = 1, #list2 do 
    print(list2[i])
end
--> 주의 : #list2 는 0 이기 때문에 수행 되지 않는다. 

for k, v in pairs(list2) do 
    print(k, v)
end
--> eng	100
--> sci	80
--> math	90



print('--------------------------------------------------------------------')
print('배열과 (키/값)이 섞인 테이블에 대한 for')
print('--------------------------------------------------------------------')
local list3 = {'국어', eng = 100, math = 90, sci = 80}

for i = 1, #list3 do 
    print(list3[i])
end
--> 국어

for k, v in pairs(list3) do 
    print(k, v)
end
--> 1	국어
--> eng	100
--> sci	80
--> math	90
